今日算法题：不同的二叉搜索树

题目地址
https://leetcode-cn.com/problems/unique-binary-search-trees/

前置知识
二叉搜索树
分治

题目描述
给定一个整数 n，求以 1 ... n 为节点组成的二叉搜索树有多少种？

示例:

输入: 3
输出: 5
解释:
给定 n = 3, 一共有 5 种不同结构的二叉搜索树:

1         3     3      2      1
\       /     /      / \      \
3     2     1      1   3      2
/     /       \                 \
2     1         2                 3

你：____________________________

资料
https://www.developerway.com/posts/react-re-renders-guide
想要破局 
1.自动远离一切国内文档 社区 能够自顶向下的获取技术的深度和广度
2.广泛的摄取技术体系 补充计算机专业知识和全方面技术视野
3.有敏锐的技术嗅觉 能够根据业务场景 胜任任何技术栈给团队提供技术愿景技术结构
4.综合素质的提升 对前端架构的细节认知和落地有丰富的经验 并能从根本出发改变和选择团队的技术架构选型